In [1]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({
    "key" : ["A","B","C","D"],
    "time" : pd.to_datetime(
        ["2019-01-01 00:00:00", "2019-01-03 00:00:00", "2019-01-06 00:00:00", "2019-01-08 00:00:00"]
    )
})

df2 = pd.DataFrame({
    "key" : ["A","A","D","E"],
    "time" : pd.to_datetime(
        ["2019-01-01 00:02:00", "2019-01-03 00:04:00", "2019-01-07 00:00:00", "2019-01-09 00:00:00"]
    ),
    "value" : [1,2,3,4]
})

In [5]:
df1

  key       time
0   A 2019-01-01
1   B 2019-01-03
2   C 2019-01-06
3   D 2019-01-08

In [6]:
df2

  key                time  value
0   A 2019-01-01 00:02:00      1
1   A 2019-01-03 00:04:00      2
2   D 2019-01-07 00:00:00      3
3   E 2019-01-09 00:00:00      4

In [11]:
pd.merge_asof(df1, df2, on="time", tolerance=pd.Timedelta("5min") ) #, by="key"

  key_x       time key_y  value
0     A 2019-01-01   NaN    NaN
1     B 2019-01-03   NaN    NaN
2     C 2019-01-06   NaN    NaN
3     D 2019-01-08   NaN    NaN